app/Controllers/Crud.php

SELECT *
FROM `tb_mahasiswa`
ORDER BY `nim` ASC
---
    public function index()
    {
        $all = $this->mahasiswa->orderBy('nim', 'ASC')->findAll();

INSERT INTO `tb_mahasiswa` (`nim`, `nama`, `prodi`, `universitas`, `no_hp`) VALUES ('32602400047', 'Ezzy Kurbana', 'Teknik Informatika', 'UNISSULA', '1234567')
---
    public function simpan()
    {
        $nim         = trim((string) $this->request->getPost('nim'));
        $nama        = trim((string) $this->request->getPost('nama'));
        $prodi       = trim((string) $this->request->getPost('prodi'));
        $universitas = trim((string) $this->request->getPost('universitas'));
        $noHp        = trim((string) $this->request->getPost('no_hp'));

        if ($nim === '' || $nama === '' || $prodi === '' || $universitas === '' || $noHp === '') {
            return redirect()->back()->withInput()->with('error', 'Semua data wajib diisi.');
        }

        $data = [
            'nim'         => $nim,
            'nama'        => $nama,
            'prodi'       => $prodi,
            'universitas' => $universitas,
            'no_hp'       => $noHp,
        ];

        $this->mahasiswa->insert($data);

SELECT *
FROM `tb_mahasiswa`
WHERE `tb_mahasiswa`.`nim` = '326024000123'
---
    public function edit($nim)
    {
        $mahasiswa = $this->mahasiswa->find($nim);

SELECT *
FROM `tb_mahasiswa`
WHERE `tb_mahasiswa`.`nim` = '326024000123'
UPDATE `tb_mahasiswa` SET `nim` = '326024000123', `nama` = 'Ezzy_CRUDedite', `prodi` = 'Teknik Informatika', `universitas` = 'UNISSULA', `no_hp` = '123456789'
WHERE `nim` = '326024000123'
---
    public function update()
    {
        $nimLama     = trim((string) $this->request->getPost('nim_lama'));
        $nimBaru     = trim((string) $this->request->getPost('nim'));
        $nama        = trim((string) $this->request->getPost('nama'));
        $prodi       = trim((string) $this->request->getPost('prodi'));
        $universitas = trim((string) $this->request->getPost('universitas'));
        $noHp        = trim((string) $this->request->getPost('no_hp'));

        if ($nimLama === '' || $nimBaru === '' || $nama === '' || $prodi === '' || $universitas === '' || $noHp === '') {
            return redirect()->back()->withInput()->with('error', 'Semua data wajib diisi.');
        }

        $data = [
            'nim'         => $nimBaru,
            'nama'        => $nama,
            'prodi'       => $prodi,
            'universitas' => $universitas,
            'no_hp'       => $noHp,
        ];

        $this->mahasiswa->where('nim', $nimLama)->set($data)->update();

DELETE FROM `tb_mahasiswa`
WHERE `nim` IN ('326024000123')
---
    public function hapus($nim)
    {
        $this->mahasiswa->delete($nim);